//
//  Constants.swift
//  Challange-ZodiacSign-Layout
//
//  Created by Apple M1 on 16.06.2024.
//

import Foundation

struct K {
    
    // MARK: - Fonts
    static let fontLato400 = "Lato-Regular"
    static let fontLato500 = "Lato-Medium"
    static let fontLato600 = "Lato-SemiBold"
    
    // MARK: - Labels
    static let zodiacSign = "Знак зодиака"
    static let zodiacElement = "Стихия"
    static let zodiacStone = "Камень"
    static let zodiacAscendant = "Асцендент"
    static let zodiacColor = "Цвет"
    static let zodiacAbode = "Обитель"
    
    static let characterTraits = "Черты характера"
    
    static let luckTitle = "Удача"
    static let kindnessTitle = "Доброта"
    static let mindTitle = "Ум"
    
    static let descriptionTitle = "Описание"
    static let astrologyTitle = "Астрология"
    static let meaningOfNameTitle = "Значение имени"
    
    static let descriptionText = "Согласно проведенному анализу расположения звезд в день рождения вашего ребенка и благозвучных имен к отчеству Витальевич, наиболее подходящим именем станет Владислав. Если вы решите назвать своего малыша Владиславом, то данное имя одарит его не только глубоким интеллектом и аналитическим складом ума, но и сильным внутренним вдохновением и творческим потенциалом.\n\nТакой текст подчеркивает уникальные черты личности, которые могут быть связаны с именем Владислав, и придает импульс положительного развития личности вашего ребенка."
    
    static let astrologyText = "Благодаря исследованию ваших дат рождения и дня появления на свет вашего сына Владислава, рожденного в год Тигра, можно с уверенностью сказать, что он обладает особым характером и великим потенциалом. Имя Владислав подарит ему не только смекалку и проницательность, но и врожденный талант к лидерству и достижению целей. Ведь такие дети способны не только воплощать в реальность свои мечты, но и вдохновлять окружающих на подвиги и достижения."
    
    static let meaningOfNameText = "Владислав с юного возраста проявляет удивительную любознательность и оптимизм в отношении жизненных вызовов. За него вам точно не придется переживать, ведь его врожденный сильный характер и решительность не позволят ему сломаться ни перед какими трудностями. Имя Владислав подарит ему не только мудрость и глубокое понимание окружающего мира, но и великий талант находить креативные решения и вдохновлять окружающих своими идеями и устремлениями."
    
    private init () {}
}
